app/views/orders/_form.html.erb

SELECT "orders".* FROM "orders" WHERE "orders"."id" = 216 LIMIT 1
---
    <div id="error_explanation">
      <%= t('errors.template.header', :count=>@order.errors.size, :model=>t('activerecord.models.order')) %>