app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(params[:comment])

    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("updated_at", "title", "content", "create_at", "product_id", "created_at") VALUES ('2011-08-11 03:01:24.000000', 'MyString', 'MyText', '2011-08-09 09:17:09.000000', 1, '2011-08-11 03:01:24.000000')

  def update
    @comment = Comment.find(params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = 980190962 LIMIT 1