app/controllers/comments_controller.rb

  def index
    #@comments = Comment.all
	@comments = Comment.paginate :page=>params[:page], :order=>'created_at desc', :per_page =>5
---
SELECT "comments".* FROM "comments" ORDER BY created_at desc LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "comments"

  def show
    @comment = Comment.find(params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = 5 LIMIT 1

  def edit
    @comment = Comment.find(params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = 30 LIMIT 1

  def create
    @comment = Comment.new(params[:comment])

    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("title", "create_at", "product_id", "updated_at", "content", "created_at") VALUES ('asdfasdfasdfasdfasdf', '2011-08-09 09:31:12.807588', 3, '2011-08-09 09:31:12.809588', 'asdfasdfasdfasdfasdf', '2011-08-09 09:31:12.809588')

  def destroy
    @comment = Comment.find(params[:id])
    @comment.destroy
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = 1 LIMIT 1
DELETE FROM "comments" WHERE "comments"."id" = 1