app/controllers/line_items_controller.rb

  def index
    @line_items = LineItem.all
---
SELECT "line_items".* FROM "line_items"

  def show
    @line_item = LineItem.find(params[:id])
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = 980190962 LIMIT 1

  def edit
    @line_item = LineItem.find(params[:id])
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = 980190962 LIMIT 1

  def create
    @cart = current_cart
	product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save
---
INSERT INTO "line_items" ("updated_at", "quantity", "product_id", "cart_id", "order_id", "created_at") VALUES ('2011-07-28 09:10:33.584793', 1, 207281424, 980190963, NULL, '2011-07-28 09:10:33.584793')

  def update
    @line_item = LineItem.find(params[:id])
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = 980190962 LIMIT 1

  def destroy
    @line_item = LineItem.find(params[:id])
    @line_item.destroy
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = 980190962 LIMIT 1
DELETE FROM "line_items" WHERE "line_items"."id" = 980190962