app/controllers/line_items_controller.rb

  def create
    @cart = current_cart
	product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = 3 ORDER BY title LIMIT 1
INSERT INTO "carts" ("updated_at", "created_at") VALUES ('2011-07-14 07:21:49.112826', '2011-07-14 07:21:49.112826')
INSERT INTO "line_items" ("updated_at", "quantity", "created_at", "product_id", "order_id", "cart_id") VALUES ('2011-08-09 07:45:24.124464', 1, '2011-08-09 07:45:24.124464', 3, NULL, 134)
UPDATE "line_items" SET "updated_at" = '2011-07-14 08:10:30.424916', "quantity" = 2 WHERE "line_items"."id" = 4