app/controllers/orders_controller.rb

  def index
#    @orders = Order.all
    @orders = Order.paginate :page=>params[:page], :order=>'created_at desc',:per_page =>10
---
SELECT "orders".* FROM "orders" ORDER BY created_at desc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "orders"

  def show
    @order = Order.find(params[:id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = 211 LIMIT 1

  def new
    if current_cart.line_items.empty?
---
SELECT COUNT(*) FROM "line_items" WHERE ("line_items".cart_id = 61)

  def edit
    @order = Order.find(params[:id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = 216 LIMIT 1

  def create
    @order = Order.new(params[:order])

    #计数操作
    current_cart.line_items.each do |item|
      item.product.sale_num =0
      item.product.sale_num += item.quantity
      item.product.save
    end

    @order.add_line_items_from_cart(current_cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])
---
SELECT "line_items".* FROM "line_items" WHERE ("line_items".order_id = 203)
UPDATE "line_items" SET "updated_at" = '2011-07-22 03:32:59.492441', "order_id" = 207, "cart_id" = NULL WHERE "line_items"."id" = 67
INSERT INTO "carts" ("updated_at", "created_at") VALUES ('2011-07-22 03:25:18.574021', '2011-07-22 03:25:18.574021')
INSERT INTO "orders" ("email", "pay_type", "created_at", "updated_at", "name", "address") VALUES ('customer@163.com', 'Check', '2011-07-21 04:00:30.195163', '2011-07-21 04:00:30.195163', 'Dave Thomas', '123 Main St')
DELETE FROM "carts" WHERE "carts"."id" = 61

  def update
    @order = Order.find(params[:id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = 216 LIMIT 1

  def destroy
    @order = Order.find(params[:id])
    @order.destroy
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = 213 LIMIT 1
DELETE FROM "orders" WHERE "orders"."id" = 213