app/controllers/orders_controller.rb

  def create
    @order = Order.new(params[:order])

    #计数操作
    current_cart.line_items.each do |item|
      item.product.sale_num =0
      item.product.sale_num += item.quantity
      item.product.save
    end

    @order.add_line_items_from_cart(current_cart)

    respond_to do |format|
      if @order.save
---
UPDATE "products" SET "updated_at" = '2011-08-12 12:33:07.080971', "sale_num" = 1 WHERE "products"."id" = 207281424
INSERT INTO "carts" ("created_at", "updated_at") VALUES ('2011-07-25 03:02:47.304729', '2011-07-25 03:02:47.304729')
INSERT INTO "orders" ("updated_at", "pay_type", "name", "email", "created_at", "address") VALUES ('2011-07-28 09:05:33.739863', 'Check', 'Dave Thomas', 'dave@example.com', '2011-07-28 09:05:33.739863', '123 The Street')