app/controllers/products_controller.rb

  def edit
    @product = Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = 980190962 LIMIT 1

  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("updated_at", "created_at", "sale_num", "description", "price", "title", "image_url") VALUES ('2011-08-16 07:08:46.314654', '2011-08-16 07:08:46.314654', 0, 'Wibbles are fun!', 19.95, 'Lorem Ipsum', 'lorem.jpg')

  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])
---
SELECT "products".* FROM "products" WHERE "products"."id" = 980190962 LIMIT 1
UPDATE "products" SET "updated_at" = '2011-08-16 13:03:49.075360', "price" = 19.95, "description" = 'Wibbles are fun!', "image_url" = 'lorem.jpg', "title" = 'Lorem Ipsum' WHERE "products"."id" = 980190962

  def destroy
    @product = Product.find(params[:id])
    @product.destroy
---
SELECT "products".* FROM "products" WHERE "products"."id" = 980190962 ORDER BY title LIMIT 1
DELETE FROM "products" WHERE "products"."id" = 980190962