app/controllers/products_controller.rb

  def index

    #@products = Product.all
	 @products = Product.paginate :page=>params[:page], :order=>'created_at desc', :per_page =>3
---
SELECT "products".* FROM "products" ORDER BY title, created_at desc LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM "products"

  def show

	@cart = current_cart;
    @product = Product.find(params[:id])
	#@comments = Comment.where(:product_id => @product.id)
	@comments = Comment.where(:product_id => @product.id).paginate :page=>params[:page], :order=>'created_at desc', :per_page =>5
---
SELECT "products".* FROM "products" WHERE "products"."id" = 7 ORDER BY title LIMIT 1
SELECT "comments".* FROM "comments" WHERE "comments"."product_id" = 5 ORDER BY created_at desc LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "comments" WHERE "comments"."product_id" = 3

  def edit
    @product = Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = 3 ORDER BY title LIMIT 1

  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("updated_at", "created_at", "image_url", "title", "description", "price") VALUES ('2011-08-10 01:27:51.690700', '2011-08-10 01:27:51.690700', '/images/ruby.jpg', 'adsfasdfasdfasdfsda', 'fasdfasdfasdfasdfasdfasdf', 23.0)

  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])
---
SELECT "products".* FROM "products" WHERE "products"."id" = 6 ORDER BY title LIMIT 1
UPDATE "products" SET "title" = 'Headfirst of Ruby', "description" = 'This is a book of Ruby.The name id Head First of Ruby .It is related to the Ruby on rails.', "updated_at" = '2011-08-10 01:47:08.681569' WHERE "products"."id" = 5