app/controllers/users_controller.rb

  def index
    @users = User.order(:name)
---
SELECT "users".* FROM "users" WHERE "users"."name" = 'kiluya' LIMIT 1

  def create
    @user = User.new(params[:user])
    @user.usertype=2
    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("updated_at", "hashed_password", "created_at", "name", "salt") VALUES ('2011-07-25 08:10:49.199908', 'e3213e7c0951df0036f20764161d713255ebff7721d1c2987fa89162fd7bda78', '2011-07-25 08:10:49.199908', 'kiluya', '1142060760.00493780913720288')

  def destroy
    @user = User.find(params[:id])
	begin
      @user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
DELETE FROM "users" WHERE "users"."id" = 2