app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    @user.usertype=2
    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "usertype", "created_at", "updated_at", "salt", "hashed_password") VALUES ('sam', 2, '2011-08-16 13:40:33.571450', '2011-08-16 13:40:33.571450', '490941360.00911812685527646', '001ea74733a264cfc02d8665b4b9a9101b0ca6ff0e2f5292437316b8d4c129be')

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 980190962 LIMIT 1
UPDATE "users" SET "salt" = '509508480.0159469288507674', "name" = 'sam', "hashed_password" = 'ab4459b5d3411dd3f74da42209f598e661045cd7be354fd0947333b1e7459d81', "updated_at" = '2011-08-11 03:26:16.120259' WHERE "users"."id" = 980190962